{
    "HomePage": {
        "Main": {
            "name": "Huidi Qiu",
            "greeting": "Hi there 👋 This is Gary's personal website"
        },
        "Navigation": {
            "Expertise": "Expertise",
            "History": "History",
            "Projects": "Projects",
            "Contact": "Contact"
        },
        "Expertise": {
            "Title": "Expertise",
            "Part1":{
                "title": "Game Client Development",
                "content": [
                    "I specialize in <1><2>game client development</2></1> with hands-on experience from my internship at <1><2>Tencent Lightspeed Studio</2></1>.",
                    "I am skilled in using <1><2>RenderDoc</2></1> for frame capturing and reverse-engineering complex rendering workflows.",
                    "With a strong foundation in <1><2>OpenGL</2></1> and a portfolio of related projects, I also have a working knowledge of <1><2>Vulkan</2></1>.",
                    "Additionally, I am familiar with <1><2>Unreal Engine</2></1> and have experience developing custom plugins to extend its functionality."
                ]
            },
            "Part2": {
                "title": "Programming Languages",
                "content": [
                    "I am highly familiar with <1><2>C++</2></1>, having completed <1><2>Advanced C++20 Programming</2></1> and developed numerous related projects such as a mini-engine.",
                    "I specialize in profiling programs and resolving performance bottlenecks efficiently, while maintaining strict and consistent coding standards.",
                    "In addition, I have extensive experience with <1><2>Python</2></1>, which has been an essential tool throughout my graduate research.",
                    "Beyond typical scripting, I have developed various plugins using Python, including those for <1><2>ZBrush</2></1>, <1><2>3ds Max</2></1>, <1><2>Blender</2></1>, and <1><2>RenderDoc</2></1>."
                ]
            },
            "Part3": {
                "title": "Research",
                "content": [
                    "My research focuses on real-time relighting algorithms based on <1><2>2D Gaussian Splatting</2></1>.",
                    "I have a solid background in <1><2>deep learning</2></1> and am familiar with <1><2>Python</2></1> and <1><2>PyTorch</2></1>.",
                    "I am skilled at implementing academic papers and rapidly understanding their key contributions."
                ]
            },
            "KeyWords": "Key words"
        },
        "History": {
            "Title": "History",
            "Time1": {
                "title": "Undergraduate Student",
                "subtitle": "Sichuan University",
                "content": "Major in Computer Science and Technology"
            },
            "Time2": {
                "title": "Graduate Researcher",
                "subtitle": "Sichuan University",
                "content": "Computer Graphics, Rendering Algorithms, Gaussian Splatting"
            },
            "Time3": {
                "title": "Game Client Development Intern",
                "subtitle": "Tencent Lightspeed Studios",
                "content": "Unreal Engine, RenderDoc, DCC Plugin Development"
            }
        },
        "Projects": {
            "Title": "Projects",
            "project-pika-engine": {
                "title": "Pika Engine",
                "description": "Pika Engine is a self-developed mini-engine designed to apply and realize the knowledge I’ve acquired through hands-on implementation."
            },
            "project-cod-analysis": {
                "title": "CoD: BO6 Analysis",
                "description": "Conducted in-depth analysis of the 2024 Call of Duty: Black Ops VI rendering techniques during an internship at Tencent."
            },
            "project-raytracing": {
                "title": "Ray-Tracing",
			    "description": "A ray-tracing practice project. Currently implemented with CPU multithreading; the goal is to migrate to Vulkan for GPU acceleration."
            }
        },
        "Contact": {
            "Title": "Contact Me",
            "Name": {
                "label": "Your Name",
                "placeholder": "What's your name?",
                "helperText": "Please enter your name"
            },
            "Email": {
                "label": "Email / Phone",
                "placeholder": "How can I reach you?",
                "helperText": "Please enter your email or phone number"
            },
            "Message": {
                "label": "Message",
                "placeholder": "Send me any inquiries or questions",
                "helperText": "Please enter the message"
            },
            "Send": "Send"
        }
    },

    "PikaEnginePage": {
        "Title": "Pika Engine",
        "Contents": {
            "title": "Contents",
            "items": {
                "Abstract": "Abstract",
                "ECS": "Entity Component System",
                "Lighting&Shadow": "Lighting & Shadow",
                "Material": "Material",
                "Render": "Render",
                "Physics": "Physics",
                "Serialization": "Serialization",
                "Conclusion": "Conclusion"
            }
        },
        "Abstract": {
            "title": "Abstract",
            "content1": [
               "Pika Engine is a self-developed mini-engine designed to apply and realize the knowledge I’ve acquired through hands-on implementation. Development has been on hold since I started my internship at <1>Tencent Lightspeed Studios</1>, but I plan to revisit and upgrade the engine when time permits in the future.",
               "The current Pika Engine supports both 2D and 3D scenes. In 2D scenes, it uses Quads as primitives and supports <1>Batch Rendering</1> to render the entire scene with a minimal number of draw calls. It also supports <1>2D physics simulation</1>."
            ],
            "content2": [
               "For 3D scenes, it currently supports <1>Skybox</1>, <1>Lighting</1>, and <1>Shadows</1>, and allows importing Mesh data in formats such as OBJ and FBX. The current material system is relatively simple and uses predefined <1>Blinn-Phong</1> materials. Support for <1>physically based rendering (PBR)</1> materials will be added in future versions."
            ]
        },
        "ECS": {
            "title": "Entity Component System",
            "content1": [
                "The <1>Entity Component System (ECS)</1> is a powerful architectural pattern widely adopted in modern game engines, including <1>Unreal Engine (UE)</1> and <1>Unity</1>, due to its flexibility, scalability, and performance benefits.",
                "Pika Engine utilizes the third-party library <3>entt</3> to implement its own ECS (Entity Component System). The separation of data and logic allows Pika to efficiently manage entities and their associated components, such as <1>UUID</1>, <1>Material</1>, <1>Mesh</1>, and others."
            ],
            "content2": [
                "As shown in the figure above, you can easily configure component properties, add or remove components, and perform other operations through the UI."
            ]
        },
        "Lighting&Shadow": {
            "title": "Lighting & Shadow",
            "content1": [
                "The Pika engine currently supports point lights, spotlights, and directional lights, each with integrated shadow mapping. Additional lighting types, such as area lights and emissive surfaces, are planned for future updates.",
                "To reduce common shadow mapping artifacts—particularly <1>moiré patterns</1> and <1>surface acne</1>—the engine leverages <1>reverse-Z</1> buffering alongside enhanced depth precision techniques to improve visual fidelity. <1>Depth bias</1> remains a particularly tricky aspect; a dynamic, slope-aware biasing strategy is planned for future implementation to adapt to varying light directions and surface normals, which is expected to effectively mitigate such artifacts."
            ],
            "content2": [
                "More advanced shadowing techniques such as <1>Cascaded Shadow Maps (CSM)</1>, <1>Percentage Closer Filtering (PCF)</1>, and <1>Percentage Closer Soft Shadows (PCSS)</1> have not yet been implemented, but are planned for future integration as the engine evolves."
            ]
        },
        "Material": {
            "title": "Material",
            "content": [
                "In terms of material support, the Pika engine currently offers a configurable <1>Blinn-Phong</1> shading model. Future updates will introduce support for physically based rendering (PBR) materials, as well as comprehensive import and export functionality for mainstream 3D model formats along with their associated material data. Widely used embedded-material formats such as <1>FBX</1>, <1>glb</1>, and <1>glTF</1> will be supported to ensure seamless integration with popular modeling tools and asset pipelines."
            ]
        },
        "Render": {
            "title": "Render",
            "content": [
                "Pika's rendering interface is designed using the Factory design pattern, with a clear separation between the rendering abstraction layer and the underlying graphics API. The original intent behind this design was to ensure flexibility and allow support for multiple graphics backends such as <1>OpenGL</1>, <1>DirectX 12</1>, <1>Vulkan</1>, and <1>Metal</1>.",
                "However, I later realized a key limitation with this approach: designing the API to be compatible with all backends means I have to accommodate the least capable one—namely OpenGL. Since OpenGL lacks support for modern features like command buffers and multithreaded rendering, this severely restricts the potential of my rendering system.",
                "As a result, I plan to fully drop OpenGL in the future and adopt a Vulkan-only backend. Vulkan is not only cross-platform—helping reduce development overhead—but also aligns better with my expertise, allowing me to implement more advanced and efficient rendering features."
            ]
        },
        "Physics": {
            "title": "Physics",
            "content": [
                "Physics systems are now an essential part of modern game engines. Currently, the Pika engine only supports physics simulation in 2D scenes. I integrated the open-source <3>Box2D</3> library to add physical collision detection and 2D rigid body components for entities in 2D scenes. For 3D scenes, NVIDIA <4>PhysX</4> is intended to be used for implementing physical simulations, with more advanced physics features planned for future development."
            ]
        },
        "Serialization": {
            "title": "Serialization",
            "content1": [
                "Serialization in Pika includes both scene serialization and deserialization. When saving the current scene state, Pika serializes key scene information into a <3>YAML</3>-based .pika file. You can import a scene by simply dragging it from the <1>Content Browser</1> into the <1>Viewport</1>, or by using the Import option from the menu bar."
            ],
            "content2": [
                "In addition, model files are also part of the serialization system. Currently, model data import and export are supported through the <3>Assimp</3> library. To load a 3D model, you can simply drag the corresponding file into the Model Component section."
            ]
        },
        "Conclusion": {
            "title": "Conclusion",
            "content": [
                "The Pika engine is a work-in-progress project. During my internship, I had limited time to keep it updated. I originally started this engine to integrate the graphics algorithms I had learned into a single impressive project and to use it as a showcase during interviews. Building the core framework consumed a significant amount of my energy, leaving little time to implement various rendering algorithms and engine features.",
                "Today, I have gained much deeper knowledge in computer graphics. I’ve analyzed the rendering techniques of cutting-edge games like <1><2>Call of Duty: Black Ops 6</2></1> and <1><2>Infinity Nikki</2></1>, and I’m currently studying the rendering concepts presented in <1><2>Real-Time Rendering, 4th Edition</2></1>. I now better understand the complexity behind top-tier engines like Unreal Engine, particularly systems such as <1>Lumen</1> and <1>Nanite</1>.",
                "With this experience, I’m more prepared than ever to advance the development of the Pika engine. In the future, Pika will focus heavily on 3D capabilities, introducing scripting support, a material system, and more rendering features including—but not limited to—anti-aliasing, ambient occlusion, and global illumination. I also plan to fully abandon OpenGL in favor of Vulkan to achieve more efficient rendering. Stay tuned."
            ]
        }
    },

    "CODAnalysisPage": {
        "Title": "Call of Duty: Black Ops VI Analysis",
        "Contents": {
            "title": "Contents",
            "items": {
                "Abstract": "Abstract"
            }
        },
        "Abstract": {
            "title": "Abstract"
        }
    }

}